dany994/vak-opensource/trunk/microcontrollers/pic32sim/mz.c
            /* Reset all devices */
            io_reset();
            sdcard_reset();
        }
	break;

    /*-------------------------------------------------------------------------
     * Peripheral port select registers: input.
     */
    STORAGE (INT1R);    pps_input_group1 (address, data); break;
    STORAGE (T4CKR);    pps_input_group1 (address, data); break;
    STORAGE (T9CKR);    pps_input_group1 (address, data); break;
    STORAGE (IC1R);     pps_input_group1 (address, data); break;
    STORAGE (IC6R);     pps_input_group1 (address, data); break;
    STORAGE (U3CTSR);   pps_input_group1 (address, data); break;
    STORAGE (U4RXR);    pps_input_group1 (address, data); break;
    STORAGE (U6RXR);    pps_input_group1 (address, data); break;
    STORAGE (SS2R);     pps_input_group1 (address, data); break;
    STORAGE (SDI6R);    pps_input_group1 (address, data); break;
    STORAGE (OCFAR);    pps_input_group1 (address, data); break;
    STORAGE (REFCLKI3R);pps_input_group1 (address, data); break;

    STORAGE (INT2R);    pps_input_group2 (address, data); break;
    STORAGE (T3CKR);    pps_input_group2 (address, data); break;
    STORAGE (T8CKR);    pps_input_group2 (address, data); break;
    STORAGE (IC2R);     pps_input_group2 (address, data); break;
    STORAGE (IC5R);     pps_input_group2 (address, data); break;
    STORAGE (IC9R);     pps_input_group2 (address, data); break;
    STORAGE (U1CTSR);   pps_input_group2 (address, data); break;
    STORAGE (U2RXR);    pps_input_group2 (address, data); break;
    STORAGE (U5CTSR);   pps_input_group2 (address, data); break;
    STORAGE (SS1R);     pps_input_group2 (address, data); break;
    STORAGE (SS3R);     pps_input_group2 (address, data); break;
    STORAGE (SS4R);     pps_input_group2 (address, data); break;
    STORAGE (SS5R);     pps_input_group2 (address, data); break;
    STORAGE (C2RXR);    pps_input_group2 (address, data); break;

    STORAGE (INT3R);    pps_input_group3 (address, data); break;
    STORAGE (T2CKR);    pps_input_group3 (address, data); break;
    STORAGE (T6CKR);    pps_input_group3 (address, data); break;
    STORAGE (IC3R);     pps_input_group3 (address, data); break;
    STORAGE (IC7R);     pps_input_group3 (address, data); break;
    STORAGE (U1RXR);    pps_input_group3 (address, data); break;
    STORAGE (U2CTSR);   pps_input_group3 (address, data); break;
    STORAGE (U5RXR);    pps_input_group3 (address, data); break;
    STORAGE (U6CTSR);   pps_input_group3 (address, data); break;
    STORAGE (SDI1R);    pps_input_group3 (address, data); break;
    STORAGE (SDI3R);    pps_input_group3 (address, data); break;
    STORAGE (SDI5R);    pps_input_group3 (address, data); break;
    STORAGE (SS6R);     pps_input_group3 (address, data); break;
    STORAGE (REFCLKI1R);pps_input_group3 (address, data); break;

    STORAGE (INT4R);    pps_input_group4 (address, data); break;
    STORAGE (T5CKR);    pps_input_group4 (address, data); break;
    STORAGE (T7CKR);    pps_input_group4 (address, data); break;
    STORAGE (IC4R);     pps_input_group4 (address, data); break;
    STORAGE (IC8R);     pps_input_group4 (address, data); break;
    STORAGE (U3RXR);    pps_input_group4 (address, data); break;
    STORAGE (U4CTSR);   pps_input_group4 (address, data); break;
    STORAGE (SDI2R);    pps_input_group4 (address, data); break;
    STORAGE (SDI4R);    pps_input_group4 (address, data); break;
    STORAGE (C1RXR);    pps_input_group4 (address, data); break;
    STORAGE (REFCLKI4R);pps_input_group4 (address, data); break;

    /*-------------------------------------------------------------------------
     * Peripheral port select registers: output.
     */
    STORAGE (RPA15R);   pps_output_group1 (address, data); break;
    STORAGE (RPB1R);    pps_output_group1 (address, data); break;
    STORAGE (RPB3R);    pps_output_group1 (address, data); break;
    STORAGE (RPC4R);    pps_output_group1 (address, data); break;
    STORAGE (RPC13R);   pps_output_group1 (address, data); break;
    STORAGE (RPD3R);    pps_output_group1 (address, data); break;
    STORAGE (RPD7R);    pps_output_group1 (address, data); break;
    STORAGE (RPD11R);   pps_output_group1 (address, data); break;
    STORAGE (RPD15R);   pps_output_group1 (address, data); break;
    STORAGE (RPE5R);    pps_output_group1 (address, data); break;
    STORAGE (RPF0R);    pps_output_group1 (address, data); break;
    STORAGE (RPF5R);    pps_output_group1 (address, data); break;
    STORAGE (RPG0R);    pps_output_group1 (address, data); break;
    STORAGE (RPG7R);    pps_output_group1 (address, data); break;

    STORAGE (RPB2R);    pps_output_group2 (address, data); break;
    STORAGE (RPB6R);    pps_output_group2 (address, data); break;
    STORAGE (RPB14R);   pps_output_group2 (address, data); break;
    STORAGE (RPC2R);    pps_output_group2 (address, data); break;
    STORAGE (RPD0R);    pps_output_group2 (address, data); break;
    STORAGE (RPD1R);    pps_output_group2 (address, data); break;
    STORAGE (RPD5R);    pps_output_group2 (address, data); break;
    STORAGE (RPE8R);    pps_output_group2 (address, data); break;
    STORAGE (RPF2R);    pps_output_group2 (address, data); break;
    STORAGE (RPF3R);    pps_output_group2 (address, data); break;
    STORAGE (RPF13R);   pps_output_group2 (address, data); break;
    STORAGE (RPG9R);    pps_output_group2 (address, data); break;

    STORAGE (RPA14R);   pps_output_group3 (address, data); break;
    STORAGE (RPB5R);    pps_output_group3 (address, data); break;
    STORAGE (RPB9R);    pps_output_group3 (address, data); break;
    STORAGE (RPB10R);   pps_output_group3 (address, data); break;
    STORAGE (RPC1R);    pps_output_group3 (address, data); break;
    STORAGE (RPC14R);   pps_output_group3 (address, data); break;
    STORAGE (RPD2R);    pps_output_group3 (address, data); break;
    STORAGE (RPD6R);    pps_output_group3 (address, data); break;
    STORAGE (RPD10R);   pps_output_group3 (address, data); break;
    STORAGE (RPD14R);   pps_output_group3 (address, data); break;
    STORAGE (RPF1R);    pps_output_group3 (address, data); break;
    STORAGE (RPF4R);    pps_output_group3 (address, data); break;
    STORAGE (RPG1R);    pps_output_group3 (address, data); break;
    STORAGE (RPG8R);    pps_output_group3 (address, data); break;

    STORAGE (RPB0R);    pps_output_group4 (address, data); break;
    STORAGE (RPB7R);    pps_output_group4 (address, data); break;
    STORAGE (RPB8R);    pps_output_group4 (address, data); break;
    STORAGE (RPB15R);   pps_output_group4 (address, data); break;
    STORAGE (RPC3R);    pps_output_group4 (address, data); break;
    STORAGE (RPD4R);    pps_output_group4 (address, data); break;
    STORAGE (RPD9R);    pps_output_group4 (address, data); break;
    STORAGE (RPD12R);   pps_output_group4 (address, data); break;
    STORAGE (RPE3R);    pps_output_group4 (address, data); break;
    STORAGE (RPE9R);    pps_output_group4 (address, data); break;
    STORAGE (RPF8R);    pps_output_group4 (address, data); break;
    STORAGE (RPF12R);   pps_output_group4 (address, data); break;
    STORAGE (RPG6R);    pps_output_group4 (address, data); break;

    /*-------------------------------------------------------------------------
     * General purpose IO signals.
     */
    WRITEOP (TRISA); return;	    // Port A: mask of inputs
    WRITEOPX(PORTA, LATA);          // Port A: write outputs
    WRITEOP (LATA);                 // Port A: write outputs
        gpio_write (0, VALUE(LATA));
	return;
    WRITEOP (ODCA); return;	    // Port A: open drain configuration
    WRITEOP (CNPUA); return;	    // Input pin pull-up
    WRITEOP (CNPDA); return;	    // Input pin pull-down
    WRITEOP (CNCONA); return;	    // Interrupt-on-change control
    WRITEOP (CNENA); return;	    // Input change interrupt enable
    WRITEOP (CNSTATA); return;	    // Input change status

